In [17]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine, text
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

In [19]:
#Establish a connection between Python and the Sakila database.
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [60]:
# 2 Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:
# engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
# month: an integer representing the month for which rental data is to be retrieved.
# year: an integer representing the year for which rental data is to be retrieved.

In [21]:
from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM rental')
    result = connection.execute(query)

result

In [23]:
with engine.connect() as connection:
    query = text('SELECT * FROM rental')
    result = connection.execute(query)
    df = pd.DataFrame(result.all())

df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

In [43]:

# Queries to retrieve the number of rentals for each customer in May and June
query_may = '''
SELECT 
    customer_id, 
    COUNT(rental_id) AS no_of_rentals 
FROM 
    rental 
WHERE 
    rental_date BETWEEN '2005-05-01' AND '2005-05-31' 
GROUP BY 
    customer_id 
ORDER BY 
    customer_id;
'''

query_june = '''
SELECT 
    customer_id, 
    COUNT(rental_id) AS no_of_rentals 
FROM 
    rental 
WHERE 
    rental_date BETWEEN '2005-06-01' AND '2005-06-30'
GROUP BY 
    customer_id 
ORDER BY 
    customer_id;
'''

# Retrieve data from the database and store in DataFrames
with engine.connect() as connection:
    data_may = pd.read_sql_query(query_may, connection)
    data_june = pd.read_sql_query(query_june, connection)

# Function to check if customers borrowed more or less in June compared to May
def compare_rentals(may_df, june_df):
    # Merge the two DataFrames on customer_id
    merged_df = pd.merge(may_df, june_df, on='customer_id', how='outer', suffixes=('_may', '_june'))
    
    # Fill NaN values with 0 for customers who had no rentals
    merged_df.fillna(0, inplace=True)
    
    # Determine if the rentals increased or decreased, and create a new column for the result
    merged_df['comparison'] = merged_df.apply(
        lambda row: 'More' if row['no_of_rentals_june'] > row['no_of_rentals_may'] else 
                     ('Less' if row['no_of_rentals_june'] < row['no_of_rentals_may'] else 
                      'Same'), axis=1
    )
    
    return merged_df[['customer_id', 'no_of_rentals_may', 'no_of_rentals_june', 'comparison']]

# Call the function and retrieve the comparison results
rentals_comparison = compare_rentals(data_may, data_june)

# Display the comparison results
rentals_comparison

     customer_id  no_of_rentals_may  no_of_rentals_june comparison
0              1                2.0                 7.0       More
1              2                1.0                 1.0       Same
2              3                2.0                 4.0       More
3              4                0.0                 6.0       More
4              5                1.0                 5.0       More
..           ...                ...                 ...        ...
592          595                1.0                 2.0       More
593          596                6.0                 2.0       Less
594          597                2.0                 3.0       More
595          598                0.0                 1.0       More
596          599                0.0                 4.0       More

[597 rows x 4 columns]

In [49]:
merged = data_may.merge(data_june, how='inner', on='customer_id')
merged

     customer_id  no_of_rentals_x  no_of_rentals_y
0              1                2                7
1              2                1                1
2              3                2                4
3              5                1                5
4              6                3                4
..           ...              ...              ...
471          593                2                4
472          594                2                6
473          595                1                2
474          596                6                2
475          597                2                3

[476 rows x 3 columns]

In [51]:
may = 0
june = 0
for value in range(len(merged['customer_id'])):
    if merged.no_of_rentals_x[value] > merged.no_of_rentals_y[value]:
        may += 1
    else:
        june +=1
print ('On may,',may,'customers made more rentals');
print ('On june,',june,'customers made more rentals');
if may > june:
    print( 'May wins!')
else:
    print('June wins!')

On may, 73 customers made more rentals
On june, 403 customers made more rentals
June wins!